ABOUT = """
عود یک ربات تلگرامی است که شامل آثار شاعران بزرگ فارسی است.
این آثار از پایگاه داده‌ی گنجور جمع آوری شده است.
کد منبع این ربات متن باز و در این آدرس در دسترس است.
"""

START = """
سلام. من عود هستم. منبع آثار شاعران فارسی زبان
برای دسترسی به راهنمای عود از دستور /help استفاده کنید
"""

OPINION = """
ممنون از ارسال نظرات‌تون
لطفا دیدگاه خودتون درباره‌ی عود رو در پیام بعدی ارسال کنید
"""

HELP = """
برای لیست شاعران از دستور /poet استفاده کنید
"""

WHY_OUD = """
عود هم یک ساز موسیقیه هم یک چوب خوشبو
"""

COMMAND_NOT_FOUND = """
دستور داده شده نامعتبر است
"""

__all__ = ("ABOUT", "START", "OPINION", "HELP", "WHY_OUD")
