ABOUT = """
عود یک ربات تلگرامی است که شامل آثار شاعران بزرگ فارسی زبان است.
این آثار از پایگاه داده‌ی <a href="https://ganjoor.net/">گنجور</a> جمع آوری شده است.
کد منبع این ربات متن باز و در <a href="https://github.com/mmmr77/oud">این آدرس</a> در دسترس است.
"""

START = """
سلام. به عود، منبع آثار شاعران فارسی زبان خوش آمدید.
برای دسترسی به راهنمای عود از دستور /help استفاده کنید.
"""

OPINION = """
ممنون از ارسال نظرات‌تون
لطفا دیدگاه خودتون درباره‌ی عود رو در پیام بعدی ارسال کنید.
در صورتی که منصرف شدید، کلمه‌ی لغو رو ارسال کنید.
"""

SEARCH = "عبارت مورد نظر خود را برای جستجو در متن آثار، نام شاعران یا عنوان آثار وارد کنید."

SEARCH_DESTINATION = "عبارت شما در کجا جستجو شود؟"

SEARCH_POET = "نام شاعران"

SEARCH_POEM_TITLE = "عنوان آثار"

SEARCH_VERSE = "متن آثار"

SEARCH_NO_RESULT = "هیچ نتیجه‌ای یافت نشد."

SEARCH_RESULT_COUNT = "جستجوی شما {count} نتیجه داشت."

SEARCH_SHOWING_TOP_RESULTS = " نمایش مرتبط‌ترین نتایج:"

SEARCH_CHARACTERS_NOT_VALID = "عبارت جستجو باید دارای حداقل سه حرف و حداکثر صد حرف باشد."

SEARCH_CANCEL = "جستجو لغو شد."

SEARCH_RETRY = "خطا! لطفا عبارت مورد نظر را مجددا وارد نمایید."

CANCEL = "لغو"

OPINION_SUBMIT = "پیام شما ثبت شد."

OPINION_CANCEL = "ارسال پیام لغو شد."

OPINION_TO_ADMIN = """
یک پیام از {user}
{username}

پاسخ به این نظر با:
/reply_{user_id}_{message_id}
"""

HELP = """
برای لیست شاعران از دستور /poets استفاده کنید.
برای جستجو، عبارت مورد نظر خود را ارسال کنید.
برای مشاهده‌ی فهرست آثار مورد علاقه‌ی خود، دستور /favorites را وارد کنید.
برای مشاهده‌ی تمام قابلیت‌های عود، منوی پایین را باز نمایید.
"""

POETS = "شاعر مورد نظر خود را انتخاب کنید"

# TODO add "{poet} - {category}" at the beginning of the message
POEMS = "شعر مورد نظر خود را انتخاب کنید"

POEM_NOT_FOUND = "شعر مورد نظر یافت نشد."

POET = """
درباره‌ی {poet}

{description}
"""

POEM = """
<a href="{url}">{title}</a>

{poem}

{poet}
@{username}
"""

INVALID_COMMAND = "دستور داده شده نامعتبر است."

INTERNAL_ERROR = "متاسفانه مشکلی پیش آمد. لطفا کمی بعد دوباره تلاش کنید."

SEND_YOUR_MESSAGE = "پیام مورد نظر خود را ارسال کنید."

ADMIN_SEND_TO_ALL_SUMMARY = """
پیام شما ارسال شد.
ارسال موفق: {sent}
مسدود شده: {blocked}
ناموفق: {failed}
"""

RECITATION_COUNT = """
برای این اثر {count} خوانش موجود است. خوانش مورد نظر خود را انتخاب کنید.
خوانش‌ها به صورت کلی از دو نوع "ساده" و "همراه با تفسیر" هستند که عبارت داخل پرانتز آن را مشخص می‌کند.
"""

RECITATION_BUTTON = "خوانش‌ها ({count}) 🎙"

SONG_COUNT = """برای این اثر {count} آهنگ موجود است. آهنگ مورد نظر خود را انتخاب کنید."""

SONG_BUTTON = "آهنگ‌ها ({count}) 🎵"

FAVORITE_ADD = "افزودن به علاقه‌مندی‌ها ❤️"

FAVORITE_ADDED = "به علاقه‌مندی‌ها اضافه شد."

FAVORITE_ALREADY_IN_FAVORITES = "این شعر از قبل در فهرست علاقه‌مندی‌های شما ثبت شده است."

FAVORITE_REMOVE = "حذف از علاقه‌مندی‌ها 💔"

FAVORITE_REMOVED = "از علاقه‌مندی‌ها حذف شد."

FAVORITE_NOT_IN_FAVORITES = "این شعر در فهرست علاقه‌مندی‌های شما نیست."

FAVORITE_NO_RESULT = "شما شعری را به علاقه‌مندی‌های خود اضافه نکرده‌اید."

FAVORITE_NO_MORE_ADD_ALLOWED = "خطا: حداکثر تعداد مجاز برای آثار مورد علاقه {count} عدد است."

OMEN_INTRO = """ایرانیان طبق رسوم قدیمی خود در روزهای عید ملی یا مذهبی نظیر نوروز و یا شب یلدا، با کتاب حافظ فال می‌گیرند. در میان ایرانیان این باور وجود دارد که شیخ حافظ شیرازی داننده اسرار نهان می‌باشد و هنگام مواجه شدن با مشکلات یا دو راهی‌های زندگی با گرفتن فال حافظ می‌توانند تصمیم درست را بگیرند.

توصیه می‌شود قبل از گرفتن فال حافظ، مقدمات آن را فراهم کرده و با آرامش و خلوص نیت به فال گیری اقدام کنید. فال گیرنده، ابتدا باید در دل نیت و حاجت خود را بیان کند. نیت مهم‌ترین بخش فال حافظ است. سپس برخی برای شادی روح حافظ فاتحه یا صلواتی نثار می‌کنند. آنگاه پس از ذکر عبارتی که معمولا به شکل روبرو گفته می‌شود فال خود را می‌خوانند: <b>ای حافظ شیرازی! تو محرم هر رازی! تو را به خدا و به شاخ نباتت قسم می‌دهم که هر چه صلاح و مصلحت می‌بینی برایم آشکار و آرزوی مرا برآورده سازی</b>.

مطمئنا بهترین تعبیر کننده‌ی فال حافظ برای شما خودتان هستید. تشخیص خوب و بد از محتوای غزل، بستگی به وضعیت روحی، عاطفی و باور صاحب فال دارد. در هر صورت در هر غزل حافظ بیتی وجود دارد که صاحب فال آن را مناسب آرزو و نیت خود می‌یابد و همان را به عنوان وصف الحال و جواب حافظ می‌پذیرد.
"""

OMEN_RESULT = """
تعبیر:

{interpretation}

@{username}
"""

FAQ = """
<b>چه داده‌ای از من نگهداری می‌شود؟</b>
در حال حاضر، تنها فهرست آثار مورد علاقه‌ی کاربران و نظرات ارسالی آن‌ها نگهداری می‌شود و هیچ داده‌ای از عبارات جستجو شده، آثار پیمایش شده و… نگهداری نمی‌شود.

<b>چگونه می‌توانم خوانشم را به عود اضافه کنم؟</b>
امکان اضافه کردن خوانش به صورت مستقیم به عود وجود ندارد. عود خوانش‌های خود را از سایت گنجور دریافت می‌کند و شما می‌توانید با مطالعه‌ی <a href="https://ava.ganjoor.net/about">راهنمای اضافه کردن خوانش به گنجور</a>، این کار را انجام دهید. پس از تایید خوانش شما و قرار گرفتن آن در گنجور، خوانش‌تان بعد از حداکثر یک روز به صورت خودکار به عود نیز اضافه خواهد شد.

<b>پیوند اشتراک اثر چیست؟</b>
در زیر هر اثر دکمه‌ای با این عنوان وجود دارد. با ضربه یا کلیک بر روی این دکمه پیوندی (لینک) در حافظه‌ی موقت (clipboard) رونوشت (کپی) می‌شود. با همرسانی (share) این پیوند در شبکه‌های اجتماعی دیگر یا ارسال آن به دوستان خود، کاربران می‌توانند به آن اثر دسترسی پیدا کنند.

<b>آیا عود به گنجور مرتبط است؟</b>
خیر، عود یک پروژه‌ی مستقل است.

<b>پیشنهاد، نظر یا مشکل مربوط به عود را چگونه گزارش کنم؟</b>
لطفا از طریق گزینه‌ی ارسال نظر در منوی ربات اقدام به ارسال پیام کنید.
"""

DONATE = """
عود یک پروژه‌ی متن‌باز است که برای نگهداری و توسعه‌اش دارای هزینه‌های جاری است.
اگر از عود استفاده می‌کنید و می‌خواهید از توسعه‌ی آن حمایت کنید، می‌توانید از طریق لینک زیر حمایت مالی کنید:

🔗 <a href="https://hamibash.com/oud">لینک حمایت مالی</a>

از حمایت‌تان متشکرم! ❤️
"""

__all__ = ("ABOUT", "OPINION", "HELP", "SEARCH", "FAQ", "DONATE")
